---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.InvalidBalustersPattern
source: html/e181402e-9582-78b1-791c-d7797564efbe.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.InvalidBalustersPattern Property

Invalid Balusters Pattern

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidBalustersPattern { get; }
```